---
kind: property
id: P:Autodesk.Revit.UI.PreviewControl.UIView
source: html/3e1416ef-179c-82a0-8124-7cc95f80b04a.htm
---
# Autodesk.Revit.UI.PreviewControl.UIView Property

The UI view representing the preview view.

## Syntax (C#)
```csharp
public UIView UIView { get; }
```

## Remarks
Use this handle to manipulate the zoom and pan of the view.